{
  "articles": [
    {
      "id": 1,
      "title": "The Polk Conspiracy — short summary",
      "source": "Kati Marton, The Polk Conspiracy (1990)",
      "year": 1990,
      "text": "Kati Marton reexamines George Polk’s life, reporting, and the investigation into his death, arguing that the official account left many questions unanswered.",
      "full": "Marton’s book walks through Polk’s reporting in Greece and the messy investigation that followed his murder. She looks at trial records, interviews with people involved, and how political pressures shaped the official story. Marton does not claim to have the final answer, but she argues convincingly that important leads and inconsistencies were ignored and that some confessions may have been coerced.",
      "url": "https://books.google.com/books/about/The_Polk_Conspiracy.html?id=uhJcBAAAQBAJ"
    },
    {
      "id": 2,
      "title": "The George Polk Case (declassified documents & analysis)",
      "source": "National Security Archive — 'The George Polk Case' briefing book",
      "year": 2007,
      "text": "The National Security Archive collected declassified State Department and intelligence cables that shed light on the Polk investigation and show U.S. officials’ concerns.",
      "full": "The Archive’s briefing book assembles cables, memoranda and analysis that reveal how diplomats and intelligence officers tracked the Polk case. It highlights conflicting witness reports, questions about the official prosecutions, and notes about missing or destroyed records. These documents are a key primary source for anyone researching the case.",
      "url": "https://nsarchive2.gwu.edu/NSAEBB/NSAEBB226/index.htm"
    },
    {
      "id": 3,
      "title": "Cover-Up Is Alleged in Reporter's Killing in Greece (1977)",
      "source": "The Washington Post (April 26, 1977)",
      "year": 1977,
      "text": "A 1977 Washington Post article revisits the Polk case and reports allegations that the official narrative may have covered up inconvenient facts.",
      "full": "This Washington Post piece examines claims that the original investigation was hurried and that evidence put forward at trial was weaker than publicly presented. The article helped renew interest in the case in the 1970s and drew on interviews and documents that suggested alternate scenarios for Polk’s death.",
      "url": "https://www.washingtonpost.com/archive/politics/1977/04/26/cover-up-is-alleged-in-reporters-killing-in-greece-in-1948/78dfb6a2-e00e-4fcb-9906-0bb58f66510a/"
    },
    {
      "id": 4,
      "title": "Contemporaneous press: 'Appointment in Salonika' (Time)",
      "source": "Time Magazine (May 1948)",
      "year": 1948,
      "text": "Contemporary coverage (Time and others) reported Polk’s disappearance and the discovery of his body in Salonika Bay, plus the initial claims blaming guerrillas.",
      "full": "Time covered Polk’s disappearance and the discovery of his body in mid-May 1948, relaying the official account that blamed communist guerrillas. These early reports are useful to see how the story first appeared in the international press and how official claims shaped the narrative then.",
      "url": "https://time.com/archive/6785299/the-press-appointment-in-salonika/"
    },
    {
      "id": 5,
      "title": "William Price Collection on the Murder of George Polk (finding aid)",
      "source": "NYU Tamiment/Wagner Library — William Price Collection",
      "year": 1996,
      "text": "NYU’s finding aid describes the William Price collection, which contains transcripts, clippings and materials from the Newsmen’s Commission that investigated Polk’s death.",
      "full": "The William Price Collection at NYU holds correspondence, trial transcripts, press clippings and other materials gathered by journalists and campaigners who looked into Polk’s murder. The finding aid explains what is in the collection and how researchers can access these primary materials.",
      "url": "https://findingaids.library.nyu.edu/tamwag/tam_159/contents/"
    },
    {
      "id": 6,
      "title": "Greek press & retrospectives (examples)",
      "source": "Kathimerini / Greek research pieces (example PDF and local retrospectives)",
      "year": 2004,
      "text": "Greek-language retrospectives and academic notes revisit the facts, local context, and enduring questions about the Polk case in Thessaloniki.",
      "full": "Greek newspapers and researchers have repeatedly returned to the Polk case, summarizing the discovery of Polk’s body in the Thermaic Gulf, the arrests and trial, and the continuing debate in Greece over who was responsible. A few Greek research papers and press retrospectives collect local testimony and archival references that complement English-language sources.",
      "url": "https://s.kathimerini.gr/resources/article-files/meletigiapolk.pdf"
    },
    {
      "id": 7,
      "title": "Academic discussion: 'The Salonika Bay Murder' (Edmund Keeley) and related studies",
      "source": "Edmund Keeley, The Salonika Bay Murder (1989) — scholarly perspective",
      "year": 1989,
      "text": "Edmund Keeley’s academic treatment (and other scholarly work) places Polk’s death in Cold War context and examines trial records and political pressures.",
      "full": "Keeley’s study and other scholarly works analyze how the Greek civil war and early Cold War politics affected investigations and public narratives. These works are useful for understanding broader structural reasons why the case was handled the way it was and why it remains contested.",
      "url": "https://nsarchive2.gwu.edu/NSAEBB/NSAEBB226/index.htm"
    },
    {
      "id": 8,
      "title": "George Polk Awards — background and history",
      "source": "Long Island University — George Polk Awards pages",
      "year": 1949,
      "text": "Long Island University established the George Polk Awards in 1949 in memory of Polk to honor investigative and courageous reporting.",
      "full": "The Polk Awards were created shortly after Polk’s death to recognize courageous reporting. LIU’s site includes a history of the award and lists past winners — the awards are part of Polk’s continuing legacy in journalism.",
      "url": "https://liu.edu/polk"
    }
  ]
}
