{
  "articles": [
    {
      "id": 1,
      "title": "The Polk Conspiracy: summary and claims",
      "source": "Kati Marton, The Polk Conspiracy (1990)",
      "year": 1990,
      "text": "Marton’s book reexamines the Polk murder and argues that the official investigation left important questions unanswered; she discusses alleged cover-ups and problematic evidence.",
      "full": "Kati Marton’s The Polk Conspiracy (1990) offers a narrative reconstruction of George Polk’s life, reporting and death. Marton casts doubt on the official account by examining trial records, witness statements and interviews with investigators. She argues that some confessions were likely coerced and that political and intelligence actors created incentives to close the case quickly. Marton’s work is an important secondary source for understanding the contested evidence and the broader Cold War environment that shaped the investigation."
    },
    {
      "id": 2,
      "title": "Declassified cables in the Polk file",
      "source": "National Security Archive — George Polk collection (declassified materials)",
      "year": 2002,
      "text": "Declassified State Department and intelligence cables point to inconsistent witness reports and to internal U.S. concerns about how the Greek investigation was unfolding.",
      "full": "The National Security Archive’s George Polk collection aggregates declassified cables, State Department memoranda and intelligence reports that illuminate the U.S. diplomatic and intelligence view of the investigation. Several contemporaneous documents reveal American officials’ unease with rushed prosecutions and identify lines of inquiry that were not fully pursued in public trials. These materials are invaluable for researchers tracing how international actors viewed the case and the reliability of local evidence."
    },
    {
      "id": 3,
      "title": "Contemporaneous press dispatches: initial coverage",
      "source": "The New York Times, Washington Post (1948 contemporary dispatches)",
      "year": 1948,
      "text": "Immediate newspaper reporting recorded Polk’s disappearance and the discovery of his body, the arrests that followed, and the official narrative that initially attributed the killing to guerrilla action.",
      "full": "In May 1948 major U.S. newspapers covered Polk’s disappearance, the discovery of his body in Salonika Bay, and the swift arrests and trials that followed. Early dispatches focused on the drama of a journalist found executed in a turbulent region and relayed official statements blaming communist guerrillas. Later reporting and investigative pieces, however, raised doubts about the evidence used at trial and described contradictions in witness testimony."
    },
    {
      "id": 4,
      "title": "Reexaminations and investigative pieces",
      "source": "Post-war investigative journalism and later features (1970s–1990s)",
      "year": 1977,
      "text": "Journalistic reexaminations in later decades revisited Polk’s case with access to more documents, interviews and scholarly commentary; some pieces suggested alternate scenarios and questioned the reliability of confessions presented at trial.",
      "full": "Investigative journalists and historians in the 1970s–1990s published features that dug into previously overlooked records and interviewed surviving witnesses. These reexaminations often highlighted procedural irregularities, the political pressures on Greek prosecutors during the early Cold War, and the complex role of intelligence services operating in the region. Such work deepened skepticism about the official verdict and expanded public awareness of unresolved questions."
    },
    {
      "id": 5,
      "title": "Thessaloniki and local context",
      "source": "Mark Mazower, Salonica: City of Ghosts (2004) — contextual background",
      "year": 2004,
      "text": "Mazower’s book gives a rich history of Thessaloniki, explaining how wartime occupations, population displacements and social change made the city a contested political space in the 1940s.",
      "full": "Mark Mazower’s Salonica: City of Ghosts provides the social and cultural backdrop for understanding why Thessaloniki mattered for the Polk case. Mazower reconstructs the city’s Ottoman, Jewish and Greek layers and explains how the wartime rupture and postwar realignments produced local tensions and vulnerabilities. This context helps explain why allegations about contracts, port shipments and patronage networks resonated deeply in local political life."
    },
    {
      "id": 6,
      "title": "A Greek retrospective on the Polk case",
      "source": "Greek-language review and historical features (various Greek press and historical reviews)",
      "year": 2010,
      "text": "Greek retrospectives revisit the murder in local context, noting the political polarization of the late 1940s and the continuing local interest in who was truly responsible.",
      "full": "Several Greek-language articles and historical reviews revisit the Polk case to discuss its impact on Greek public life and memory. These pieces typically summarize the known facts—the discovery of Polk’s body in the Thermaic Gulf, the arrests and trial—and emphasize that the event is still debated among historians in Greece, especially given the tensions of the civil war and the presence of foreign intelligence actors in the region."
    },
    {
      "id": 7,
      "title": "Academic literature: trials and contested evidence",
      "source": "Scholarly articles analyzing Cold War justice and wartime prosecutions",
      "year": 1995,
      "text": "Scholars have used the Polk case to study how political pressures can shape judicial processes during wartime, pointing out patterns of rushed prosecutions and contested confessions.",
      "full": "Academic analyses of the Polk case situate it within broader studies of transitional justice, wartime prosecutions and Cold War politics. Scholars note that the need to provide a politically satisfactory outcome—especially when allied governments are under international scrutiny—can create incentives for hasty investigations and for privileging evidence consistent with strategic narratives. These studies emphasize the value of archival research and critical historiography for reassessing high-profile cases like Polk’s."
    },
    {
      "id": 8,
      "title": "Long Island University and the Polk Awards",
      "source": "Long Island University — George Polk Awards history",
      "year": 1949,
      "text": "LIU created the George Polk Awards in 1949 to honor courageous and investigative reporting in memory of Polk.",
      "full": "Following Polk’s death, Long Island University established the George Polk Awards to commemorate his commitment to investigative journalism. The awards recognize work that demonstrates courage, rigorous reporting, and public service. The history of the prize and its past winners serves as a living legacy of the values Polk embodied in his reporting."
    }
  ]
}
